using System;
using System.Collections.Generic;
using System.Linq;
using System.Web;

namespace EndProjectC.Models
{
    public class DB
    {
        public static List<Category> CategoryList { get; set; }
        public static List<User> UserList { get; set; }
        public static List<Recipe> RecipeList { get; set; }
        static DB()
        {
            CategoryList = new List<Category>()
            {
                new Category(){Id=1,Name="משקאות",Icon="cockail (1).png"},
                new Category(){Id=2,Name="בשר",Icon="boiled (2).png"},
                new Category(){Id=3,Name="עוגות",Icon="piece-of-cake.png"},
            };
            UserList = new List<User>()
            {
                new User("גיטי פדר","מקור ברוך 13 ב חיפה","g0583291321@gmail.com","123456Gf"),
                new User("תמר כהן","בן קיסמא 16 אלעד","tamar.0548432131@gmail.com","987654Tc"),
                new User("שושנה לוי","בן קיסמא 16 בני ברק","sh.levi@gmail.com","7894561r"),
            };
            RecipeList = new List<Recipe>()
            {
                new Recipe("בראוניז ב-3 שכבות",3,40,1,new DateTime(2020,1,10),
                    new List<Layer>()
                    {
                        new Layer(
                            "בסיס בראוניז",new List<string>()

                            {
                                "150 גרם שוקולד מריר",
                                "120 גרם חמאה",
                                "220 גרם סוכר לבן",
                                "3 ביצים L",
                                "1 כפית קפה נמס",
                                "3/4 כוס או 100 גרם קמח לבן",
                                "1 כף אבקת קקאו",
                                "1/4 כפית מלח דק"
                            }
                            )
                        ,
                       new Layer(
                            "שכבת גבינת שמנת", new List<string>()
                            {
                                "200 גרם גבינת שמנת 30%",
                                "50 גרם חמאה רכה",
                                "3/4 כוס או 100 גרם אבקת סוכר"
                            }
                        ),
                        new Layer(
                            "ציפוי שוקולד",  new List<string>()
                            {
                                "150 גרם שוקולד מריר",
                                "30 גרם חמאה",
                                "1/2 כוס או 120 מ\"ל שמנת מתוקה 38%",
                                "1 כפית קפה נמס"
                            }
                       )

                    }
                    ,new List<string>()
                    {
                        "מכינים את בסיס הבראוניז, אופים ומצננים לטמפרטורת החדר: מחממים תנור ל- 180 מעלות.",
                        "במיקרוגל ממיסים שוקולד וחמאה ומערבבים לתערובת אחידה.",
                        "בקערה נפרדת טורפים סוכר, ביצים ואבקת קפה נמס במרץ במשך דקה. מוסיפים את תערובת השוקולד וטורפים לאיחוד. מוסיפים קמח, קקאו ומלח וטורפים לתערובת אחידה ומבריקה.",
                        "משטחים את התערובת בתבנית מרופדת בנייר אפייה ואופים  12-15 דקות עד ששולי הבראוניז סדוקים ותפוחים. מוציאים מהתנור ומניחים בצד לצינון מלא.",
                        "מכינים את שכבת גבינת השמנת ומצננים במקרר: במיקסר עם וו גיטרה מעבדים גבינה וחמאה במהירות בינונית  2 דקות לתערובת קרמית ואחידה. מוסיפים אבקת סוכר ומעבדים עוד 2 דקות לקרם אחיד.",
                        "מורחים את תערובת הגבינה בשכבה אחידה מעל הבראוניז. מעבירים למקרר ל- 20-10 דקות (או יותר), להתייצבות.",
                        "מכינים את ציפוי השוקולד ומצננים שעתיים במקרר, לפני ההגשה: במיקרוגל מחממים יחד שוקולד, חמאה, שמנת מתוקה וקפה נמס עד להמסה. טורפים לתערובת אחידה ומצננים מעט עד שהתערובת בחום השפתיים.",
                        "מוזגים את תערובת השוקולד על שכבת הגבינה ומטים את התבנית ימינה ושמאלה, עד שהשוקולד מכסה את שכבת הגבינה לחלוטין.",
                        "מחזירים את הבראוניז למקרר לשעתיים נוספות, להמשך התייצבות.",
                        "פורסים לריבועים בעזרת סכין טבולה במים רותחים (טובלים ומנגבים בין חיתוך לחיתוך), ומגישים. שומרים מכוסה במקרר."
                    },1001,"brownies.jpg",false),
                new Recipe("חיתוכיות לימון וגבינה ללא אפייה",3,15,1,new DateTime(2020,11,12),
                    new List<Layer>()
                {
                  new Layer(
                        "תחתית", new List<string>()
                        {
                            "150 גרם פתי בר וניל",
                            "60 גרם חמאה מומסת"
                        }
                    ),new Layer(

                        "קרם", new List<string>()
                        {
                            "225 גרם גבינת שמנת 30%",
                            "45 גרם אבקת סוכר",
                            "15 מ\"ל מיץ לימון",
                            "1/2 כפית גרידת לימון",
                            "150 מ\"ל שמנת מתוקה 38%",
                            "15 גרם אבקת סוכר"
                        }
                    )
                },
                    new List<string>()
                {
                    "מרפדים את התבנית בנייר אפייה ומניחים בצד.",
                    "במעבד מזון עם להב פלדה, טוחנים את הביסקוויטים לאבקה ומערבבים יחד עם החמאה המומסת.",
                    "משטחים את התערובת על התבנית, ומעבירים למקפיא.",
                    "בקערה רחבה מניחים  45 גרם אבקת סוכר וגבינת שמנת, טורפים לבלילה חלקה.",
                    "מוסיפים את מיץ הלימון וגרידת הלימון וטורפים.",
                    "בקערת מיקסר עם בלון הקצפה מניחים  15 גרם אבקת סוכר ושמנת מתוקה, מקציפים כ- 5 דק’ עד לקבלת קצפת יציבה.",
                    "מעבירים בערך  3 כפות מהקצפת לצלחת ומניחים במקרר עד לקישוט.",
                    ".את הקצפת הנותרת מאחדים עם תערובת הגבינה",
                    "שופכים את התערובת על התחתית, ומקפיאים למשך שעתיים.",
                    "לאחר ההקפאה חותכים לריבועים. מעבירים את הקצפת ששמרנו לשקית זילוף עם צנטר חלק ומזלפים.",
                    "ניתן להוסיף מעל עוד קצת גרידת לימון."
                },1001,"Cheesecake.jpg",true),
                new Recipe("תבשיל בשר מרוקאי",2,25,1,new DateTime(2020,9,5),
                    new List<Layer>()
                {
                    new Layer("בשר",new List<string>()
                    {
                        "2 ק\"ג בשר אונטריב",
                        "1 כף זרעי כוסברה",
                        "6 עלי דפנה בינוניים"
                    }  ),new Layer("רוטב",new List<string>()
                    {
                        "1/2 כוס שמן קנולה",
                        "10 שיני שום",
                        "7 פלפלים יבשים חריפים בינוניים",
                        "3 כפות פפריקה מתוקה",
                        "1/2 כף פפריקה חריפה",
                        "1/2 כף כורכום",
                        "1/2 כף מלח דק",
                        "2 כפות כמון טחון",
                        "1 כף אבקת מרק עוף",
                        "2 פלפלים אדומים בינוניים",
                        "3 כוסות מים",
                        "6 פלפל שושקה בינוניים",
                        "1 צרור כוסברה",
                        "3 כפות רסק עגבניות",
                        "1 כוס גרגירי חומוס קפואים"
                    } )
                },
                    new List<string>()
                {
                    "מכינים את הבשר: מכניסים לתוך סיר עם מים חמים את נתח הבשר, זרעי הכוסברה ועלי הדפנה ומבשלים לפחות שעתיים (כל נתח צריך זמן שונה) עד שהבשר רך. עדיף להכניס את הנתח בשלמותו לסיר ולאחר שהנתח רך ומוכן לקרר ולחתוך לקוביות. (חשוב לבשל את הבשר עד שיהיה רך ממש לפני שמכניסים אותו לרוטב).",
                    "מכינים את הרוטב: בתוך סיר שטוח שמים את השמן, השום ופלפל שאטה. מטגנים מעט כדי לפתוח טעמים.",
                    "מוסיפים את יתר התבלינים ופותחים גם אותם בשמן על אש נמוכה.",
                    "מוסיפים את הגמבה ואת הפלפל שושקה, מוסיפים את המים החמים ומבשלים כ- 30 דקות עד שהרוטב מצטמצם מעט.",
                    "מוסיפים את קוביות הבשר שהכנו מראש לרוטב, מוסיפים את החומוס, הכוסברה והרסק, מערבבים קלות מבשלים עוד  20 דק' לפחות על אש נמוכה כדי שהבשר יתפוס טעמים."
                },1002,"maroko.jpg",true),
                new Recipe("מרק ירקות עם קציצות הודו",2,30,1,new DateTime(2020,11,9),
                    new List<Layer>()
                {
                   new Layer(
                        "מרק",new List<string>()
                    {
                        "1 צרור פטרוזיליה",
                        "1 צרור שמיר",
                        "1 בצל גדול",
                        "3 גזרים גדולים",
                        "3 תפוחי אדמה בינוניים",
                        "2 קישואים בינוניים",
                        "3/4 כוס גרגירי חומוס קפואים",
                        "1/2 1 ליטר מים",
                        "1 כף מלח דק",
                        "1 כף פפריקה מתוקה",
                        "1/2 כף כורכום",
                        "2 כפות רסק עגבניות",
                        "1 לימון בינוני",
                        "4 טיפות רוטב טבסקו"
                    }  ),new Layer(
                        "קציצות",new List<string>()
                        {
                            "1/2 ק\"ג עוף טחון",
                            "1/2 בצל בינוני",
                            "1 תפוח אדמה קטן",
                            "1 ביצה L",
                            "1 כוס פתיתים",
                            "1 כפית מלח דק",
                            "1 קורט פלפל שחור טחון",
                            "1 כף פפריקה מתוקה"
                        }
                     ),new Layer(
                        "תוספות",new List<string>()
                        {
                            "1 כוס אטריות דקיקות קצרות"
                        }
                    )
                },
                    new List<string>()
                {
                    "מכינים את המרק: קולפים, שוטפים וחותכים לחתיכות גסות את הירקות.",
                    "מחממים סיר גדול על כיריים מניחים את עשבי התיבול בתחתית, על עשבי התיבול מניחים את כל הירקות וגרגרי החומוס ומכסים במים.",
                    "מוסיפים לסיר את המלח, הפפריקה, הכורכום, רסק העגבניות והטבסקו ומביאים לרתיחה.",
                    "מכינים את הקציצות: מערבבים בקערה (בידיים) את הבשר, הבצל, תפוח האדמה, הביצה, הפתיתים (אם נשארו) המלח, הפלפל והפפריקה. מכדררים לקציצות ומוסיפים לסיר המרק.",
                    "מבשלים ברתיחה עדינה, עם מכסה,  45 דקות. מוסיפים את מיץ הלימון. מערבבים, טועמים ומתקנים תיבול.",
                    "מוסיפים לסיר אטריות, ממשיכים בבישול עד שהאטריות מוכנות ומסירים מהאש.",
                    "אחרי שהמרק התקרר, אפשר להוציא ממנו את עשבי התיבול (יוצאים כצרור אחד גדול). מומלץ מאד לסחוט אותם היטב בידיים נקיות לתוך סיר המרק (הרבה טעם טוב נסחט מהם)."
                },1001,"vegetable soup.jpg",false),
                new Recipe("רצועות בקר ושעועית ירוקה",2,10,1,new DateTime(2020,9,20),
                    new List<Layer>()
                    {
                        new Layer(
                            "רצועות בקר ושעועית",new List<string>()
                            {
                                "500 גרם שייטל בקר",
                                "1 כפית מלח דק",
                                "1/2 כפית פלפל שחור גרוס",
                                "3 כפות קורנפלור",
                                "3 כפות שמן קנולה",
                                "1 כפית שמן שומשום",
                                "400 גרם שעועית ירוקה קפואה",
                                "3 שיני שום",
                                "2 ס\"מ שורש ג’ינג’ר",
                                "60 מ\"ל רוטב סויה",
                                "1 כף חומץ אורז",
                                "3 כפות סוכר לבן"
                            }
                        ),new Layer(
                            "הגשה",new List<string>(){ "1 חופן שומשום" }
                        )
                    },
                    new List<string>()
                    {
                        "מייבשים את רצועות הבשר עם מגבת נייר, מעבירים לקערה ומתבלים במלח ופלפל. מפזרים מעל את הקורנפלור ומערבבים עד שכל הבשר מצופה.",
                        "מחממים את שני סוגי השמן במחבת ומקפיצים את השעועית במשך  2 דקות, או עד שהיא מתרככת. מכבים את הלהבה, מסננים את הנוזלים העודפים ושומרים בצד.",
                        "מחממים עוד קצת שמן במחבת ומקפיצים את רצועות הבשר עד שהן מתחילות להחליף את הצבע ולהזהיב.",
                        "מוסיפים את השום, הג’ינג’ר, הסויה, החומץ והסוכר ומערבבים היטב. מקפיצים עד שכל הבשר מצופה ברוטב.",
                        "מחזירים למחבת את השעועית ומערבבים.",
                        "מפזרים מעל שומשום ומגישים מיד."
                    },1002,"sheuhit.jpg",false),
                new Recipe("קציצות בקר ברוטב כרובית ועגבניות שרי",2,30,3,new DateTime(20,12,8),
                    new List<Layer>()
                    {
                        new Layer(
                            "רוטב",new List<string>()
                            {
                                "1 בצל בינוני",
                                "2 כפות שמן זית",
                                "3 שיני שום",
                                "1 כף כמון טחון",
                                "1 כפית כורכום",
                                "1/2 כפית הל טחון",
                                "1 כפית מלח דק",
                                "1/4 כפית פלפל שחור טחון",
                                "250 מ\"ל קרם קוקוס",
                                "100 מ\"ל מים",
                                "1 כרובית קטנה",
                                "1 כוס עגבניות שרי",
                                "2 גבעולי תימין טרי"
                            }
                       ),new Layer(
                            "קציצות בקר",new List<string>()
                            {
                                "1/2 ק\"ג בשר בקר טחון",
                                "3 כפות קמח עדשים כתומות",
                                "1 כפית כמון טחון",
                                "1/2 כפית מלח דק",
                                "1/4 כפית פלפל שחור טחון",
                                "1 קישוא בינוני"

                            }
                       )
                    },
                    new List<string>()
                    {
                        "בסיר רחב שוליים מחממים שמן זית, מטגנים קלות את הבצל הקצוץ (כיף לקצוץ בצל עם קוצץ הירקות הזה) עד לשקיפות.",
                        "מוסיפים את השום והתבלינים ומטגנים עוד דקה עד לפתיחת הטעמים ועד שעולה ניחוח של שום.",
                        "מוסיפים  250 מ”ל קרם קוקוס ו- 100 מ”ל מים, מערבבים עד לאיזון מוחלט של התערובת, מביאים לרתיחה ומנמיכים את הלהבה לנמוכה.",
                        "בקערה מערבבים את הבקר הטחון עם קמח עדשים, מלח, כמון ופלפל לתערובת אחידה ומעט דביקה (אם רוצים להעשיר את הקציצות ניתן להוסיף להן קישוא מגורד דק).",
                        "יוצרים מתערובת הבשר קציצות בגודל בינוני ומעבירים לסיר, בין הקציצות מפזרים פרחי כרובית ועגבניות שרי.",
                        "מכסים ומבשלים כחצי שעה, מידי פעם מטלטלים בעדינות את הסיר, מומלץ לא לערבב.",
                        "לאחר חצי שעה בוזקים בעזרת כף מעט מהרוטב הצהוב על הקציצות, מפזרים מעט עלי טימין ומגישים."
                    },1001,"cruvit.jpeg",false),
                new Recipe("ארוחה חגיגית בסיר אחד",2,20,1,new DateTime(2020,10,7),
                    new List<Layer>()
                    {
                         new Layer("",new List<string>()
                        {
                            "6 שוקי עוף עם עור בינוניות",
                            "4 כפות שמן זית",
                            "2 בצלים בינוניים",
                            "3 גזרים בינוניים קלופים, וחתוכים למקלות",
                            "2 כוסות גרגירי חומוס מבושלים",
                            "1 כוס צימוקים כהים",
                            "1/2 2 כוסות אורז בסמטי",
                            "1 כף כורכום",
                            "1 כפית כמון טחון",
                            "1 כפית מלח דק",
                            "1/2 כפית פלפל שחור טחון",
                            "5 כוסות מים רותחים"
                        } )
                    },
                    new List<string>()
                    {
                        "מניחים את האורז בקערה ומכסים במים. משרים למשך חצי שעה ובינתיים מכינים את שאר מרכיבי התבשיל.",
                        "מתבלים היטב את שוקי העוף במלח ופלפל משני הצדדים. מחממים את שמן הזית בסיר רחב ועמוק ובשני סבבים מטגנים את שוקי העוף עד להזהבה. מניחים בקערה.",
                        "מוסיפים לסיר את הבצלים והגזרים ומטגנים במשך  7-10 דקות עד להזהבה וריכוך.",
                        "מוסיפים את גרגירי החומוס והצימוקים ומטגנים  2-3 דקות נוספות. מתבלים במעט מלח ופלפל ומוציאים מהסיר לקערה ומכבים את הלהבה.",
                        "שוטפים את האורז היטב ומסננים. מחזירים לקערה ומערבבים עם הכורכום, כמון, מלח ופלפל שחור.",
                        "מרכיבים את הסיר: בתחתית הסיר מניחים  5 שוקי עוף וחצי מתערובת הבצלים והגזרים. מפזרים לשכבה אחידה, מעל מפזרים חצי מכמות האורז, משטחים ומהדקים בעזרת כף. חוזרים על הפעולה: מפזרים מעל שכבת האורז את  5 שוקי העוף הנותרים, את תערובת הבצלים והגזרים ומעליה את שארית האורז. משטחים ומהדקים.",
                        "מניחים את הסיר על להבה נמוכה ומוסיפים את המים הרותחים, מכסים במגבת מטבח נקייה ומעליה את המכסה של הסיר ומבשלים במשך 50 דקות. מכבים את הלהבה ומשאירים את הסיר מכוסה במשך רבע שעה נוספת.",
                        "פותחים את המכסה ומצננים חמש דקות. בזהירות רבה הופכים את הסיר על צלחת הגשה רחבה."
                    },1002,"IMG_0764-Small.jpg",true),
                new Recipe("מוקפץ בקר וברוקולי",2,20,1,new DateTime(2020,10,18),
                    new List<Layer>()
                    {
                        new Layer(
                            "בסיס", new List<string>()
                            {
                                "1/2 ק\"ג סינטה",
                                "2 כפות שמן זית",
                                "700 גרם ברוקולי"
                            }
                         ),new Layer(
                            "לרוטב:",new List<string>()
                            {
                                "1/2 כוס רוטב סויה",
                                "1 כף סוכר חום כהה",
                                "2 כפות קורנפלור",
                                "3 שיני שום כתושות",
                                "3 כפות דבש",
                                "1 כף שורש ג’ינג’ר מגורר",
                                "2 כפות שמן שומשום",
                                "1/4 כפית שבבי צ’ילי יבש",
                                "1 כף רוטב סרירצ’הכף רוטב סרירצ’ה",
                                "1/2 כוס ציר בקר (או מרק עוף או מים)",
                                "1 קורט פלפל שחור גרוס"
                            }
                        )
                    },
                    new List<string>()
                    {
                        "בקערה בינונית מערבבים יחד את רוטב הסויה, הקורנפלור, השום, הדבש, הג’ינג’ר, שמן השומשום, פתיתי הצ’ילי האדום, רוטב סריראצ’ה וציר המרק (או המים). מניחים בצד עד שמוכן לשימוש.",
                        "מחממים את שמן הזית במחבת ווק גדולה או בסיר ומקפיצים את הבשר עד שהוא מתחיל להשחים, בערך  4 עד  5 דקות. מוסיפים את הרוטב ומערבבים עם הבשר, הרוטב אמור להתחיל להסמיך מיד.",
                        "מוסיפים ברוקולי ומבשלים  2 דקות נוספות עד שהברוקולי רך והרוטב מסמיך.",
                        "מגישים מעל אורז או עם אטריות."
                    },1001,"bakarwithbrokoly.jpg",false),
                new Recipe("עוגת גבינה ושוקולד ללא אפייה",3,45,1,new DateTime(2020,10,18),
                    new List<Layer>()
                    {
                         new Layer(
                            "קרם", new List<string>()
                            {
                                "250 גרם גבינת שמנת 30%",
                                "60 גרם אבקת סוכר",
                                "150 גרם שוקולד מריר",
                                "350 מ\"ל שמנת מתוקה 38%",
                                "10 גרם אינסטנט פודינג בטעם וניל"
                            }
                       ),new Layer( "תחתית", new List<string>()
                            {
                                "150 גרם פתי בר וניל",
                                "100 גרם חמאה"
                            }
                         ),new Layer(
                            "גנאש",new List<string>()
                            {
                                "100 גרם שוקולד חלב",
                                "80 מ\"ל שמנת מתוקה 38%"
                            }
                        )
                    },new List<string>()
                    {
                        "מרפדים את תחתית התבנית בנייר אפייה ומניחים בצד עד לשימוש.",
                        "מכינים את התחתית: ממיסים את החמאה במיקרו בפולסים קצרים.",
                        "במעבד מזון עם להב פלדה, טוחנים את הביסקוויטים לאבקה, ומערבבים יחד עם החמאה המומסת.",
                        "משטחים את התערובת על תחתית התבנית, ומכניסים למקפיא.",
                        "מכינים את הקרם: ממיסים את השוקולד המריר בפולסים קצרים במיקרו עד להמסה מלאה ומניחים בצד.",
                        "בקערה נוספת, שמים גבינת שמנת ואבקת סוכר וטורפים לבלילה חלקה.",
                        "מוסיפים את השוקולד שהמסנו אל בלילת גבינת השמנת וטורפים היטב.",
                        "בקערת מיקסר עם בלון הקצפה, שמים שמנת מתוקה ופודינג וניל ומקציפים עד לקבלת קרם יציב.",
                        "מעבירים חצי מכמות הקרם אל תערובת הגבינה ומקפלים. מוסיפים את החצי הנותר ומקפלים שוב עד לאיחוד.",
                        "מוציאים את התבנית מהמקפיא, ושופכים את התערובת על התחתית.",
                        "מיישרים ומכניסים למקרר למשך כשעה.",
                        "מכינים את הגנאש: מניחים בקערה שוקולד חלב ושמנת מתוקה, ממיסים בפולסים קצרים במיקרו עד להמסה מלאה (חשוב לערבב בין פולס לפולס).",
                        "שופכים את הגנאש על העוגה ומכניסים למקרר שוב למשך כשעתיים."
                    },1002,"cheeze&cocklate.jpg",false),
                new Recipe("עוגת טראפלס שוקולדית ונימוחה",3,10,1,new DateTime(2020,11,3),
                    new List<Layer>()
                    {
                        new Layer(
                            " ", new List<string>()
                            {
                                "250 גרם מטבעות שוקולד מריר 60%",
                                "250 גרם חמאה",
                                "150 גרם סוכר לבן",
                                "4 ביצים L",
                                "70 גרם קמח לבן",
                                "1 כפית תמצית וניל",
                                "1 קורט מלח דק"
                            }
                        )
                    },
                    new List<string>()
                    {
                        "מחממים תנור לחום של  180 מעלות.",
                        "ממיסים את החמאה והשוקולד בבאן-מארי (או בפולסים במיקרו) ומערבבים היטב למסה אחידה .",
                        "בקערה נפרדת מקציפים את הביצים והסוכר לקצף תפוח בערך כחמש דקות.",
                        "מוסיפים את מסת החמאה והשוקולד המומס לקצף הביצים תוך כדי קיפול בעזרת לקקן.",
                        "מקפלים לתוך המסה את הקמח, המלח והוניל עד לקבלת תערובת חלקה והומוגנית.",
                        "יוצקים את התערובת לתבנית משומנת בקוטר  22 ס”מ, אופים בתנור שחומם מראש למשך כ- 25 דקות.",
                        "אזהרה: זמני האפייה עשויים להשתנות בהתאם לסוג התנור. עדיף תמיד לבדוק עם קיסם (העוגה צריכה לצאת מהתנור רכה ולחה אך לא נוזלית).",
                        "לאחר צינון מוחלט מומלץ לבזוק על פני העוגה קקאו ולהגיש."
                    },1001,"עוגת טראפלס.png",true),
                new Recipe("עוגת פקאן וקינמון בחושה",3,20,1,new DateTime(2020,11,12),
                    new List<Layer>()
                    {
                         new Layer(
                            "עוגה", new List<string>()
                            {
                                "4 ביצים L",
                                "200 גרם סוכר לבן",
                                "200 מ\"ל מים",
                                "150 גרם שמן קנולה",
                                "260 גרם קמח לבן",
                                "1/4 כפית קינמון טחון",
                                "1 שקית אבקת אפייה",
                                "1/2 כפית אבקת סודה לשתייה",
                                "1 כפית תמצית וניל"
                            }
                         ),new Layer(
                            "ציפוי",new List<string>()
                            {
                                "5 גרם או  1 כפית קינמון טחון",
                                "15 גרם סוכר לבן",
                                "80 גרם אגוזי פקאן"
                            }
                        )
                    },
                    new List<string>()
                    {
                        "מחממים תנור לחום של  170 מעלות.",
                        "בקערה מערבבים קמח, קינמון, אבקת אפייה ואבקת סודה לשתייה ומניחים בצד עד לשימוש.",
                        "בקערת מיקסר עם בלון הקצפה מניחים ביצים שלמות וסוכר, מקציפים כ-  5 דק’ עד לקבלת תערובת תפוחה ובהירה.",
                        "מנמיכים את עוצמת המיקסר, ומוסיפים את תמצית הוניל.",
                        "מוסיפים את השמן בזרם דק עד לספיגה ואחריו גם את המים באותו האופן.",
                        "מוסיפים מעט מתערובת הקמח בכל פעם עד שהוא נטמע בבלילה.",
                        "מרפדים את התבניות בנייר אפיה ושופכים את הבלילה.",
                        "מערבבים את כל חומרי הציפוי יחד ומפזרים על העוגות באופן אחיד.",
                        "מכניסים לתנור למשך כ- 35-40 דק’."
                    },1001,"עוגת פקאן.jpg",false),
                new Recipe("עוגת שיש שוקולד קוקוס",3,20,3,new DateTime(2020,10,18),
                    new List<Layer>()
                    {
                        new Layer(
                            " ", new List<string>()
                            {
                                "5 ביצים L",
                                "1/2 1 כוסות סוכר לבן",
                                "100 גרם או  1שקית קוקוס טחון",
                                "200 גרם חמאה",
                                "300 גרם שוקולד מריר",
                                "1 כפית קפה נמס",
                                "1/2 1 כוסות קמח לבן",
                                "1 כפית אבקת אפייה",
                                "1/4 כפית מלח דק"
                            }
                        )
                    },
                    new List<string>()
                    {
                        "מחממים תנור ל- 170 מעלות.",
                        "מפרידים  2 ביצים בלבד, את החלבונים שמים בקערה ומקציפים במערבל. כאשר נוצרות מעט בועות מסביב מוסיפים חצי כוס סוכר וממשיכים להקציף עד לקבלת קצף חזק ויציב.",
                        "מוסיפים את הקוקוס לקצף החלבונים ומקפלים בתנועות עטיפה, מניחים את הקערה בצד.",
                        "בקערה שנייה שמים את  2 החלמונים שנשארו ומוסיפים את  3 הביצים השלמות וכוס הסוכר שנותרה. מקציפים כ  3-4 דקות עד לקבלת קצף תפוח ובהיר.",
                        "שמים בקערה נפרדת חמאה, שוקולד ואבקת נס קפה וממיסים במיקרוגל כדקה וחצי. מוציאים וטורפים היטב עד לקבלת תערובת שוקולדית מבריקה.",
                        "מקפלים את תערובת הביצים הטרופות אל תערובת השוקולד עד להטמעה.",
                        "מערבבים את הקמח עם אבקת האפייה והמלח ומוסיפים בתנועות עדינות לתערובת השוקולד.",
                        "משמנים היטב את התבנית גם בחריצים.",
                        "יוצקים מחצית מתערובת השוקולד, מורחים מעל את קצף הקוקוס ולבסוף את יתרת תערובת השוקולד שנותרה.",
                        "אופים  40 דקות. העוגה מוכנה כשקיסם הננעץ במרכזה יוצא עם פירורים לחים. המנעו מאפיית יתר.",
                        "מצננים כרבע שעה והופכים על צלחת הגשה.",
                        "קישוט: אפשר להמיס  100 גרם שוקולד מריר עם  50 גרם חמאה ולמרוח על העוגה (לא חובה)."
                    },1001,"עוגת שיש.jpg",false),
                new Recipe("עוגת סופלה שוקולד",3,20,1,new DateTime(2020,10,22),
                    new List<Layer>()
                    {
                        new Layer(
                            " ", new List<string>()
                            {
                                "295 גרם שוקולד מריר",
                                "113 גרם חמאה",
                                "20 גרם או 2 כפות אבקת קקאו",
                                "150 גרם סוכר לבן",
                                "6 ביצים L"
                            }
                      )
                    },
                    new List<string>()
                    {
                        "מחממים תנור לחום של  175 מעלות.",
                        "מרפדים את דפנות התבנית והתחתית בנייר אפייה ומשמנים במעט חמאה.",
                        "ממיסים את החמאה והשוקולד במיקרו בפולסים קצרים עד להמסה מלאה, ומניחים לצינון.",
                        "בקערה נוספת שמים קקאו ו- 2 ביצים שלמות וטורפים לבלילה חלקה. מוסיפים אל תערובת השוקולד, וטורפים לאיחוד.",
                        "מפרידים את  4 הביצים הנותרות לחלמונים וחלבונים.מוסיפים את החלמונים אל בלילת השוקולד וטורפים היטב.",
                        "בקערת מיקסר עם בלון הקצפה שמים חלבונים וסוכר, ומקציפים למשך כ- 5 דק’ עד לקבלת מרנג יציב, אך לא נוקשה מדי.",
                        "מקפלים את המרנג אל תוך תערובת השוקולד.",
                        "שופכים את הבלילה אל התבנית ואופים למשך כ- 35-40 דק’.",
                        "מניחים לצינון, ומפזרים אבקת סוכר."
                    },1001,"סופלה.jpg",false),
                new Recipe("עוגת שוקולד ונס קפה",3,10,1,new DateTime(2020,10,11),
                    new List<Layer>()
                    {
                       new Layer(
                            "עוגה", new List<string>()
                            {
                                "1 כוס קמח תופח",
                                "1 כוס סוכר לבן",
                                "1 כוס שוקולית",
                                "1 כף קפה נמס",
                                "1 כוס שמן קנולה",
                                "4 ביצים L",
                                "125 מ\"ל שמנת מתוקה 38%",
                                "1 כפית תמצית וניל",
                            }
                         ),new Layer(
                            "כאשר העוגה יוצאת מהתנור שופכים:",new List<string>()
                            {
                                "1 כף קפה נמס",
                                "1/2 כוס מים רותחים"
                            }
                        ),new Layer(
                            "קרם ציפוי",new List<string>()
                            {
                                "100 גרם שוקולד מריר",
                                "125 מ\"ל שמנת מתוקה 38%"
                            }
                        )
                    },new List<string>()
                    {
                        "בקערה גדולה מערבבים את כל חומרי העוגה.",
                        "מחממים תנור ל- 180 מעלות.",
                        "משמנים תבנית אפיה עגולה (מספר 26) או תבנית קוגלהופ (כמו בתמונה). שופכים את בלילת העוגה ואופים  30 דקות.",
                        "כאשר העוגה יוצאת מהתנור שופכים עליה חצי כוס נס קפה שמכינים מכף קפה נמס וחצי כוס מים חמים(. אם יש לכם מכונת קפה, מכינים אספרסו ושופכים, זה ממש משדרג את העוגה).",
                        "מכינים את הציפוי: באמבט בן מרי ממיסים את השוקולד כאשר נמס מערבבים לתוכו את  1/2 השמנת שנותרה. שופכים על העוגה. אפשר לקשט את העוגה בסוכריות, אגוזים או פולי קפה טחונים."
                    },1001,"עוגת-שוקולד-ונס-קפה-מהירה.jpg",false),
                new Recipe("טארט סניקרס טבעוני",3,40,1,new DateTime(2020,11,10),
                    new List<Layer>()
                    {
                         new Layer(
                            "קלתית", new List<string>()
                            {
                                "1/2 1 כוסות קמח לבן",
                                "50 גרם מזולה בטעם חמאה",
                                "2 כפות חמאת בוטנים חלקה",
                                "1/4 כוס סוכר לבן",
                                "1 קורט מלח דק",
                                "5 כפות מים קרים"
                            }
                         ),new Layer(
                            "מלית סניקרס", new List<string>()
                            {
                                "1 כוס סוכר לבן",
                                "100 גרם מזולה בטעם חמאה",
                                "80 מ\"ל קרם קוקוס",
                                "2 כפות חמאת בוטנים חלקה",
                                "1/4 כפית מלח דק",
                                "3/4 כוס בוטנים קלויים"
                            }
                       ),new Layer(
                            "ציפוי וקישוט", new List<string>()
                            {
                                "150 גרם שוקולד מריר",
                                "2 כפות חמאת בוטנים חלקה",
                                "20 גרם מזולה בטעם חמאה",
                                "1 חופן בוטנים קלויים"
                            }
                        )
                    },
                    new List<string>()
                    {
                        "מחממים תנור לחום של  180 מעלות.",
                        "מכינים את הקלתית: שמים בקערת מעבד מזון את הקמח, המזולה, חמאת הבוטנים, הסוכר והמלח ומעבדים בפולסים עד לקבל תערובת פירורית יבשה. מוסיפים מים בהדרגה וממשיכים לעבד (כמה פולסים) עד לקבלת גושי בצק דביקים.",
                        "מקמחים את משטח העבודה ומרדדים את הבצק לעובי  3-4 מ”מ. מעבירים את הבצק בעזרת המערוך לתבנית ומצמידים אותו לתחתית ולדפנות. את השלב הזה אפשר לעשות בדרך פשוטה יותר ע”י הדבקת חתיכות הבצק לתחתית ולדפנות עד שנוצרת קלתית שלמה. מורידים את עודפי הבצק, ובעזרת מזלג מחוררים את התחתית.",
                        "מכסים את הקלתית עם נייר אפייה וממלאים בשעועית או כל קטנייה אחרת שמשמשת משקולת. אופים  15 דקות. מוציאים את התבנית מהתנור, מורידים את המשקולת ומחזירים לתנור ל- 10 דקות נוספות, או עד שהקלתית מתחילה להזהיב. מוציאים מהתנור ומצננים.",
                        "מכינים את המלית: מביאים את קרם הקוקוס לסף רתיחה. במקביל ממיסים על מחבת את הסוכר עד שמתקבל קרמל בצבע ענברי עמוק. מוסיפים לקרמל את המזולה ומערבבים אותה פנימה עד שהיא נמסה. ממשיכים לערבב במרץ עד שהקרמל חוזר להיות חלק. מוסיפים לקרמל את קרם הקוקוס החם (התערובת תבעבע, זה בסדר) וממשיכים לבשל תוך ערבוב עד שמתקבל טופי קרמל אחיד וחלק. מוסיפים את חמאת הבוטנים ומערבבים. אם רוצים, מוסיפים את המלח, מערבבים ומצננים בצד. כשהמלית מתחילה להסמיך, מוסיפים את הבוטנים ומערבבים.",
                        "מכינים את הציפוי: ממיסים את השוקולד, חמאת הבוטנים והמזולה על באן מרי או במיקרוגל בפולסים, ומערבבים היטב עד שמתקבלת תערובת חלקה.",
                        "מרכיבים את הטארט: יוצקים את המלית לתוך הקלתית ומיישרים. יוצקים מעל את הציפוי ומקשטים בבוטנים. מעבירים להתייצבות במקרר או מקפיא לשעתיים לפחות.",
                        "חותכים ומגישים. שומרים בכלי אטום במקרר."
                    },1001,"טורט סניקרס.jpg",false),
                new Recipe("שייק ירוק שמנקה את הגוף",1,5,1,new DateTime(2020,8,22),
                    new List<Layer>()
                    {
                         new Layer(
                            "שייק", new List<string>()
                            {
                                "2 תפוחי עץ גרני סמיט בינוניים",
                                "2 מלפפונים בינוניים",
                                "1 חבילה עלי בייבי תרד",
                                "1 אבוקדו בינוני",
                                "2 כוסות חלב שקדים",
                                "2 כפיות ממתיק טרוביה"
                            }
                        ),new Layer(
                            "הגשה", new List<string>()
                            {
                                "2 כפיות זרעי צ’יה"
                            }
                        )
                    }, new List<string>(){ "שמים בקערת בלנדר את כל מרכיבי השייק וטוחנים עד שמתקבלת תערובת אחידה.","יוצקים לכוסות הגשה, מוסיפים זרעי צ’יה ומערבבים היטב.","משאירים ל- 5 דקות, מערבבים שוב ומגישים."},1001,"09_10.jpg",false),
                new Recipe("רוזטה בננה",1,5,1,new DateTime(2020,3,21),
                    new List<Layer>()
                    {
                         new Layer(
                            "רוזטה", new List<string>()
                            {
                                "1 בננה",
                                "כוס רוזטה",
                                "כוס מים",
                                "לימון",
                                "1 קוביות קרח"
                            }
                        )
                    },
                    new List<string>()
                    {
                        "מרוקנים את גרעיני המלון. סוחטים את מיץ הלימון.",
                        "מעבירים את כל הרכיבים לסלאו ג’ויסר וסוחטים לתוך הכוסות עם הקרח והנענע. מגישים מיד."
                    },1001,"shutterstock_360609806.jpg",false),
                new Recipe("גרניטה מנגו ונענע",1,5,1,new DateTime(2020,5,10),
                    new List<Layer>()
                    {
                         new Layer(
                            "גרניטה",new List<string>()
                            {
                                "1 חבילה מנגו",
                                "1 גבעול נענע",
                                "1 כפית ממתיק טרוביה",
                                "1 כוס מים",
                                "1/2 מיץ לימון בינוני"
                            }
                        )
                    },
                    new List<string>()
                    {
                        "טוחנים את כל המרכיבים בבלנדר בפולסים קצרים ליצירת גרניטה."
                    },1001,"גרניטה-מנגו-ונענע-2-1100x733.jpg",true),
                new Recipe("שוקו חם מלטף ופיקנטי",1,10,1,new DateTime(2020,11,9),
                    new List<Layer>()
                {
                     new Layer(
                        "שוקו",new List<string>()
                        {
                            "300 גרם מטבעות שוקולד מריר 60%",
                            "2 כפות סוכר לבן",
                            "1/4 כפית אבקת צ’ילי",
                            "1/4 כפית קינמון טחון",
                            "1 כוס חלב 3%",
                            "1 כוס שמנת מתוקה 38%",
                            "1/2 כפית תמצית וניל"
                        }
                    ),new Layer(
                        "קישוט",new List<string>()
                        {
                            "1/2 מיכל שמנת מתוקה 38%",
                            "1 כף סוכר לבן"
                        }
                 )
                },
                    new List<string>()
                {
                    "מכינים את הקישוט: מקציפים את השמנת המתוקה והסוכר לקצפת יציבה ושומרים במקרר.",
                    "מכינים את השוקו: ממיסים בבן מארי את השוקולד, הסוכר והצ’ילי עד שהשוקולד נמס ומערבבים היטב.",
                    "מוסיפים תוך כדי ערבוב (עדיין על בן מארי) את החלב והשמנת המתוקה עד לסף רתיחה.",
                    "מסירים מהאש, מוסיפים את הוניל ומערבבים. טועמים, מוסיפים סוכר לפי הצורך. מקשטים בענני קצפת מתוקה ומגישים."
                },1001,"ספייסי-שוקו.jpg",false),
                new Recipe("שייק פירות טרופיים עם יוגורט ומייפל",1,3,1,new DateTime(2020,7,2),
                    new List<Layer>()
                    {
                         new Layer(
                            " ",new List<string>()
                            {
                                "1 בננה בינונית",
                                "2 כוסות פירות טריים",
                                "1 גביע יוגורט כבשים",
                                "1/2 כוס חלב 3%",
                                "1 כף סירופ מייפל"
                            }
                      )                    },
                    new List<string>()
                    {
                        "מכניסים את כל המרכיבים לתוך קנקן הבלנדר לפי הסדר.",
                        "בוחרים בתכנית  SMOOTHIEעד לקבלת מרקם אחיד ומוזגים לכוסות הגשה."
                    },1001,"shutterstock_420882607.jpg",true),
                new Recipe("חלב קשיו",1,2,1,new DateTime(2020,6,1),
                    new List<Layer>()
                    {
                         new Layer(
                            " ", new List<string>()
                            {
                                "2 כוסות אגוזי קשיו טבעיים",
                                "2 כפות סירופ מייפל",
                                "2 כפיות תמצית וניל"
                            }
                        )
                    },
                    new List<string>(){
                        "מכניסים את הקשיו, המים, סירופ המייפל ותמצית הוניל למעבד המזון.",
                        "לוחצים על  PULSEומעבירים לעוצמה חזקה לכמה שניות עד שהנוזל נצבע וכל האגוזים נמעכו (כ- 30 שניות).",
                        "מסננים דרך בד לקנקן, מקררים ושותים."
                    },1001,"5.jpg",true)
            };
        }
    }

}